*** TODO : TDEE : total daily energy expenditure
    
   | time         | weight |
   |--------------+--------|
   | wk2031(7/27) |   75.0 |
   | wk2032(8/03) |   74.5 |
   | wk2033(8/10) |   74.0 |
   | wk2034(8/17) |   73.5 |
   | wk2035(8/24) |   73.0 |
   | wk2036(8/31) |   72.5 |

| wk2031                                 | total acquired kilo calorie | exercise | Balance(b) | Calorie deficit(2387-(b)) |
|----------------------------------------+-----------------------------+----------+------------+---------------------------|
| Mon                                    |                        1409 |      638 |        771 |                     -1616 |
| Tu                                     |                        1666 |        0 |       1666 |                      -721 |
| Wed                                    |                           0 |          |          0 |                     -2387 |
| Thu                                    |                           0 |          |          0 |                     -2387 |
| Fri                                    |                           0 |          |          0 |                     -2387 |
| Sat                                    |                           0 |          |          0 |                     -2387 |
| Sun                                    |                             |          |          0 |                     -2387 |
|----------------------------------------+-----------------------------+----------+------------+---------------------------|
| Mon + Tu + Wed + Thu + Fri + Sat + Sun |                        3075 |      638 |       2437 |                    -14272 |
#+TBLFM: $4=$2-$3::$5=$4-2387::@9=vsum(@2..@8)

| best practices | morning running | morning weight training | night tennis | night power | total |
|----------------+-----------------+-------------------------+--------------+-------------+-------|
| example        |             720 |                     250 |          699 |         120 |  1789 |
#+TBLFM: $6=vsum($2..$5)

| mins | burn calorie |
|------+--------------|
|    1 |           12 |
|   30 |          360 |
|   60 |          720 |
|   80 |          960 |
|   90 |         1080 |


| alcohol  | calorie/100g |
| volka    |          230 |
| beer     |           80 |
| red wine |           ?? |
|          |              |
#+TBLFM: $2=$1*12

 7700 / 2 / 7 = 550 KCperday, if I want to lose 0.5KG per week

* TODO : open PR for imageSavingHelper 
  :LOGBOOK:
  CLOCK: [2020-07-27 Mon 14:05]--[2020-07-27 Mon 16:10] =>  2:05
  CLOCK: [2020-07-27 Mon 13:49]--[2020-07-27 Mon 14:05] =>  0:16
  :END:
* TODO : understand org-mode :
  :LOGBOOK:
  CLOCK: [2020-07-27 Mon 16:49]--[2020-07-27 Mon 17:20] =>  0:31
  :END:
  https://www.cnblogs.com/Open_Source/archive/2011/07/17/2108747.html#sec-2-1

